# SpotElevSingleOrUpperPrefix Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpotElevSingleOrUpperPrefix Property
ParameterTypeId Class See Also
---
"Single/Upper Value Prefix"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpotElevSingleOrUpperPrefix { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpotElevSingleOrUpperPrefix As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpotElevSingleOrUpperPrefix {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace